USE universidad_privada;

INSERT INTO anio_cursado (anio_cursado, nombre)
VALUES (1, "Primer año"),
(2, "Segundo año"),
(3, "Tercer año"),
(4, "Cuarto año"),
(5, "Quinto año"),
(6, "Sexto año");

INSERT INTO rol (nombre)
VALUES ("Autoridad"),
("No docente"),
("Docente"),
("Alumno"),
("proveedor");

INSERT INTO facultades (facultadID, nombre, sigla, fecha_de_creacion, personaID, rolID)
VALUES (1, "Facultad de Ciencias de la Salud", "fcs", "1981-02-01", 35145692, 1),
(2, "Facultad de Arquitectura, Urbanismo y Diseño", "faud", "1989-02-01", 21407119, 1),
(3, "Facultad de Ingenieria", "fi", "1979-02-01", 36354265, 1);

INSERT INTO carreras (facultadID, nombre, sigla, grado, fecha_de_creacion, duracion)
VALUES (1, "Licenciatura en Kinesiologia", "ki", "grado", "1982-02-01", 4),
(1, "Licenciatura en Psicologia", "psi", "grado", "1982-02-01", 5),
(1, "Licenciatura en Nutricion", "nu", "grado", "1982-02-01", 5),
(1, "Técnico en Radiología", "rad", "pregrado", "1982-02-01", 3),
(1, "Técnico en Instrumentación Quirúrgica", "iq", "pregrado", "1982-02-01", 3),
(1, "Técnico en Higiene y Seguridad Laboral", "hys", "pregrado", "1982-02-01", 3),
(2, "Arquitectura", "arq", "grado", "1990-02-01", 5),
(2, "Licenciatura en Diseño Gráfico", "gra", "grado", "1990-02-01", 4),
(2, "Licenciatura en Diseño de Indumentaria", "ind", "grado", "1990-02-01", 4),
(2, "Licenciatura en Diseño de Interiores", "int", "grado", "1990-02-01", 4),
(2, "Corredor Inmobiliario", "ci", "pregrado", "1990-02-01", 3),
(2, "Martillero Público", "ma", "pregrado", "1990-02-01", 3),
(3, "Ingenieria en Sistemas", "is", "grado", "1979-02-01", 5),
(3, "Ingenieria Industrial", "ii", "grado", "1979-02-01", 5),
(3, "Ingenieria Electrónica", "ie", "grado", "1979-02-01", 5);


INSERT INTO inscripciones (personaID, rolID, materiaID, fecha_hora_inscripcion)
format: YYYY-MM-DD HH:MI:SS
VALUES (29581911, 3, 1, "2023-03-01 09:00:24"),
(41377834, 4, 1, "2023-03-01 09:01:26"),
(42981383, 4, 1, "2023-03-01 09:02:24"),
(39967940, 4, 1, "2023-03-01 09:04:38"),
(43474407, 4, 1, "2023-03-01 09:05:05"),
(42892973, 4, 1, "2023-03-01 09:06:16"),
(45420870, 4, 1, "2023-03-01 09:06:23"),
(44975185, 4, 1, "2023-03-01 09:06:54"),
(45593830, 4, 1, "2023-03-01 09:07:01"),
(43190470, 4, 1, "2023-03-01 09:07:15"),
(41116768, 4, 1, "2023-03-01 09:07:28"),
(41378892, 4, 1, "2023-03-01 09:05:35"),
(42162232, 4, 1, "2023-03-01 09:06:16"),
(32500594, 3, 2, "2023-03-01 09:00:24")
(41377834, 4, 2, "2023-03-01 09:01:26"),
(42981383, 4, 2, "2023-03-01 09:02:24"),
(39967940, 4, 2, "2023-03-01 09:04:38"),
(43474407, 4, 2, "2023-03-01 09:05:05"),
(42892973, 4, 2, "2023-03-01 09:06:16"),
(45420870, 4, 2, "2023-03-01 09:06:23"),
(44975185, 4, 2, "2023-03-01 09:06:54"),
(45593830, 4, 2, "2023-03-01 09:07:01"),
(43190470, 4, 2, "2023-03-01 09:07:15"),
(41116768, 4, 2, "2023-03-01 09:07:28"),
(41378892, 4, 2, "2023-03-01 09:05:35"),
(42162232, 4, 2, "2023-03-01 09:06:16"),
(39738049, 3, 3, "2023-03-01 09:05:01"),
(41377834, 4, 3, "2023-03-01 09:01:26"),
(42981383, 4, 3, "2023-03-01 09:02:24"),
(39967940, 4, 3, "2023-03-01 09:04:38"),
(43474407, 4, 3, "2023-03-01 09:05:05"),
(42892973, 4, 3, "2023-03-01 09:06:16"),
(45420870, 4, 3, "2023-03-01 09:06:23"),
(44975185, 4, 3, "2023-03-01 09:06:54"),
(45593830, 4, 3, "2023-03-01 09:07:01"),
(43190470, 4, 3, "2023-03-01 09:07:15"),
(41116768, 4, 3, "2023-03-01 09:07:28"),
(41378892, 4, 3, "2023-03-01 09:05:35"),
(42162232, 4, 3, "2023-03-01 09:06:16"),
(27047087, 3, 4, "2023-03-01 09:05:01"),
(41377834, 4, 4, "2023-03-01 09:01:26"),
(42981383, 4, 4, "2023-03-01 09:02:24"),
(39967940, 4, 4, "2023-03-01 09:04:38"),
(43474407, 4, 4, "2023-03-01 09:05:05"),
(42892973, 4, 4, "2023-03-01 09:06:16"),
(45420870, 4, 4, "2023-03-01 09:06:23"),
(44975185, 4, 4, "2023-03-01 09:06:54"),
(45593830, 4, 4, "2023-03-01 09:07:01"),
(43190470, 4, 4, "2023-03-01 09:07:15"),
(41116768, 4, 4, "2023-03-01 09:07:28"),
(41378892, 4, 4, "2023-03-01 09:05:35"),
(42162232, 4, 4, "2023-03-01 09:06:16"),

; 

SELECT * FROM rol;
SELECT * FROM personas;
SELECT * FROM materias;
SELECT * FROM inscripciones;